from collections import deque

temps = [20.6, 19.4, 19.0, 19.0, 22.1,
        22.5, 22.8, 24.1, 25.6, 27.0,
        27.0, 25.6, 26.8, 27.3, 22.5,
        25.4, 24.4, 23.7, 23.6, 22.6,
        20.4, 17.9, 17.3, 17.3, 18.1,
        20.1, 22.2, 19.8, 21.3, 21.3,
        21.9]

days = deque(maxlen=7)
 
for temp in temps:
    # Добавляем температуру в очередь
    days.append(temp)
    # Если длина очереди оказалась равной максимальной длине очереди (7),
    # печатаем среднюю температуру за последние 7 дней
    print(days) #для понимания раюоты программы
    if len(days) == days.maxlen:
        print(round(sum(days) / len(days), 2), end='; ')
# Напечатаем пустую строку, чтобы завершить действие параметра
# end. Иначе следующая строка окажется напечатанной на предыдущей
print("")

"""
deque([20.6, 19.4], maxlen=7)
deque([20.6, 19.4, 19.0], maxlen=7)
deque([20.6, 19.4, 19.0, 19.0], maxlen=7)
deque([20.6, 19.4, 19.0, 19.0, 22.1], maxlen=7)
deque([20.6, 19.4, 19.0, 19.0, 22.1, 22.5], maxlen=7)
deque([20.6, 19.4, 19.0, 19.0, 22.1, 22.5, 22.8], maxlen=7)
20.77; deque([19.4, 19.0, 19.0, 22.1, 22.5, 22.8, 24.1], maxlen=7)
21.27; deque([19.0, 19.0, 22.1, 22.5, 22.8, 24.1, 25.6], maxlen=7)
22.16; deque([19.0, 22.1, 22.5, 22.8, 24.1, 25.6, 27.0], maxlen=7)
23.3; deque([22.1, 22.5, 22.8, 24.1, 25.6, 27.0, 27.0], maxlen=7)
24.44; deque([22.5, 22.8, 24.1, 25.6, 27.0, 27.0, 25.6], maxlen=7)
24.94; deque([22.8, 24.1, 25.6, 27.0, 27.0, 25.6, 26.8], maxlen=7)
25.56; deque([24.1, 25.6, 27.0, 27.0, 25.6, 26.8, 27.3], maxlen=7)
26.2; deque([25.6, 27.0, 27.0, 25.6, 26.8, 27.3, 22.5], maxlen=7)
25.97; deque([27.0, 27.0, 25.6, 26.8, 27.3, 22.5, 25.4], maxlen=7)
25.94; deque([27.0, 25.6, 26.8, 27.3, 22.5, 25.4, 24.4], maxlen=7)
25.57; deque([25.6, 26.8, 27.3, 22.5, 25.4, 24.4, 23.7], maxlen=7)
25.1; deque([26.8, 27.3, 22.5, 25.4, 24.4, 23.7, 23.6], maxlen=7)
24.81; deque([27.3, 22.5, 25.4, 24.4, 23.7, 23.6, 22.6], maxlen=7)
24.21; deque([22.5, 25.4, 24.4, 23.7, 23.6, 22.6, 20.4], maxlen=7)
23.23; deque([25.4, 24.4, 23.7, 23.6, 22.6, 20.4, 17.9], maxlen=7)
22.57; deque([24.4, 23.7, 23.6, 22.6, 20.4, 17.9, 17.3], maxlen=7)
21.41; deque([23.7, 23.6, 22.6, 20.4, 17.9, 17.3, 17.3], maxlen=7)
20.4; deque([23.6, 22.6, 20.4, 17.9, 17.3, 17.3, 18.1], maxlen=7)
19.6; deque([22.6, 20.4, 17.9, 17.3, 17.3, 18.1, 20.1], maxlen=7)
19.1; deque([20.4, 17.9, 17.3, 17.3, 18.1, 20.1, 22.2], maxlen=7)
19.04; deque([17.9, 17.3, 17.3, 18.1, 20.1, 22.2, 19.8], maxlen=7)
18.96; deque([17.3, 17.3, 18.1, 20.1, 22.2, 19.8, 21.3], maxlen=7)
19.44; deque([17.3, 18.1, 20.1, 22.2, 19.8, 21.3, 21.3], maxlen=7)
20.01; deque([18.1, 20.1, 22.2, 19.8, 21.3, 21.3, 21.9], maxlen=7)
20.67;
"""