#Дан список из кортежей temps. На первом месте в кортеже указан год в виде строки, 
# а на втором — средняя температура января в Петербурге в указанном году.
#Напишите функцию check(temps), которая будет выводить словарь, в котором ключи — годы, 
# а значения — показатели температуры. Ключи необходимо отсортировать 
# в порядке убывания соответствующих им температур.

from collections import OrderedDict

temps = [('2000', -4.4), ('2001', -2.5), ('2002', -4.4), ('2003', -9.5)]
#check = OrderedDict(sorted(temps, key=lambda x: x[1], reverse=True)) 

def check(temps):
    temps.sort(key=lambda x: x[1], reverse=True)
    return temps

print(check(temps))


#OrderedDict([('2001', -2.5), ('2000', -4.4), ('2002', -4.4), ('2003', -9.5)])