import numpy as np

#Примечание 2. Не забудьте импортировать numpy и сразу задать seed = 2021

# 1. В simple сохранте случайное число в диапазоне от 0 до 1
# 2. Сгенерируйте 120 чисел в диапазоне от -150 до 2021, сохраните их в переменную randoms
# 3. Получите массив из случайных целых чисел от 1 до 100 (включительно) из 3 строк и 2 столбцов. 
# Сохраните результат в table
# 4. В переменную even сохраните четные числа от 2 до 16 (включительно)
# 5. Скопируйте even в переменную mix. Перемешайте числа в mix так, чтобы массив изменился
# 6. Получите из even 3 числа без повторений. Сохраните их в переменную select
# 7. Получите переменную triplet, которая должна содержать перемешанные значения из массива 
# select (сам select измениться не должен)

np.random.seed(2021)

simple = np.random.rand() #1

randoms = np.random.uniform(-150, 2021, 120) #2

table = np.random.randint(1, 100, (3,2)) #3

even = np.arange(2,17,2) #4

mix = even #5
np.random.shuffle(mix)

select = np.random.choice(even, size=3, replace=False) #6

triplet = np.random.permutation(select) #7