#Напишите бесконечный итератор по списку.
#Для этого создайте генератор с названием inf_iter(l_in), который принимает на вход список l_in и возвращает
# элементы из него через yield.
#Когда элементы в списке заканчиваются, генератор снова возвращает элементы из списка, начиная с нулевого.


def group_gen(lst):
    while True:
        for ls in lst:
            yield ls

l = [101, 102, 103]
gen = inf_iter(l)
for _ in range(999):
    print(next(gen))