#Выберите из списка reg только те записи, в которых год рождения пользователя 2000 и больше (2001, 2002 и т. д.).
# Из оставшихся записей составьте новый список кортежей, в котором фамилия и имя объединены в одну строку
# по следующему шаблону Фамилия И. (обратите внимание на точку после сокращения имени).

reg = [('Ivanov', 'Sergej', 24, 9, 1995),
      ('Smith', 'John', 13, 2, 2003),
      ('Petrova', 'Maria', 13, 3, 2003)]

#def update_tuple(arg):
    # Выделяем фамилию из кортежа
#    surname = arg[0]
    # Выделяем имя из кортежа
#    name = arg[1]
    # Создаём новую запись: фамилия + пробел + первая буква имени + точка
#    new_surname = surname + ' ' + name[0] + '.'
    # Возвращаем обновлённый кортеж
#    return (new_surname, arg[2], arg[3], arg[4])

#filter_reg = filter(lambda x: x[-1] >= 2000, reg)

#new_reg = list(map(update_tuple, filter_reg))

def update_tuple(arg):
    # Выделяем фамилию из кортежа
    surname = arg[0]
    # Выделяем имя из кортежа
    name = arg[1]
    # Создаём новую запись: фамилия + пробел + первая буква имени + точка
    new_surname = surname + ' ' + name[0] + '.'
    # Возвращаем обновлённый кортеж
    return (new_surname, arg[2], arg[3], arg[4])

# Фильтруем записи по условию, что последний элемент кортежа >= 2000
filter_reg = filter(lambda x: x[-1] >= 2000, reg)
# Применяем функцию-преобразование к каждому кортежу из списка и создаём новый список
new_reg = list(map(update_tuple, filter_reg))

print(new_reg)
