#Напишите функцию mult, которая считает произведение переданных в неё чисел через запятую.
def mult(*args):
    # Вместо pass напишите тело функции
    # pass
    p = 1
    for i in args:
        p *= i
    return(p)

print(mult(3,5,10))