#Напишите lambda-функцию area, которая принимает на вход два числа — стороны прямоугольника
# — через запятую и возвращает площадь прямоугольника.

area = lambda a, b : a * b

print(area(12,5))
# 60