#Напишите цикл while, который вычисляет произведение натуральных чисел (1*2*3*4*...). Цикл должен
# выполняться до тех пор, пока значение произведения не превысит 1 000.
# В ответ запишите полученное после цикла произведение.

numb = 1
sum = 1

while sum < 1000:
    sum = sum * numb
    numb += 1
    print(sum)
print(sum)