#Напишите программу, которая возводит число 3 в n-ю степень (3, 9, 27 …), начиная с n = 1, пока результат
# будет менее 1000. На какой итерации остановится ваш цикл (до начала выполнения цикла количество итераций равно 0)?

n = 1 #задаём начальное значение степени
count = 0 #задаём количество итераций
#создаём цикл, который будет выполняться, пока 3 в степени n меньше 1000
while 3 ** n < 1000: #делай, пока...
    count += 1 #увеличиваем количество итераций
    n += 1 #увеличиваем степень на 1
print(count) #выводим результирующее количество итераций


#numb = 3
#n = 1
#i = 0
#sum = 0

#while sum < 1000:
#    sum = numb ** n
#    n+=1
#    i+=1
#    print(sum)
#    print(n)
#print('======')
#print(i)

#ответ 6