#Напишите цикл while, который находит максимальное натуральное число, квадрат которого меньше 1000.
s = 0
n = 1

while s < 1000:
    s = n**2
    n+=1
    print(f'Произведение: {s}')
    print(f'Натуральное число: {n}')
    print('-------')
print(f'Настуральное число : {n-1}')