#Напишите бесконечный цикл while с условием выхода внутри цикла,
#который находит максимальное натуральное число, квадрат которого меньше 1000.
s = 0
n = 1

while True:
    if n**2 <= 1000:
      #s = n**2
      n+=1
      print(f'Произведение: {n**2}')
      print(f'Натуральное число: {n}')
      print('-------')
    else:
        break
print(f'Настуральное число : {n-1}')