#Напишите код, который определяет, является ли вложенный список квадратной матрицей
# (то есть матрицей, у которой количество строк равно количеству столбцов).
# В конце программа должна выводить на экран значение True или False в зависимости от заданного вложенного списка.

test_matrix1 = [
    [1, 2, 3],
    [7, -1, 2],
    [123, 2, -1]
]
test_matrix2 = [
    [1, 2, 3],
    [7, -1, 2],
    [123, 2, -1],
    [123, 5, 1]
]

N1 = len(test_matrix1)
N2 = len(test_matrix2)
M1 = len(test_matrix1[0])
M2 = len(test_matrix2[0])

if N1 == M1:
    print('test_matrix1 - True')
if N2 == M2:
    print('test_matrix2 - True')

#num_lines = len(test_matrix1) #вычисляем число строк в матрице
#count = 0 #задаём начальное количество строк, длина которых совпадает с числом строк в матрице
#создаём цикл по строкам матрицы
#for line in test_matrix1: #line — текущая строка матрицы
    #проверяем, что длина текущей строки равна количеству строк
#    if len(line) == num_lines: #если условие выполняется,
#        count += 1 #увеличиваем количество строк, длина которых совпадает с числом строк в матрице
#сравниваем полученное число с числом строк в матрице и выводим результат
#print(num_lines == count)