#Мы дали начинающему программисту задание написать программу, которая находит номер всех дней, когда
# наблюдался отток клиентов (динамика была отрицательной), а также находит количество ушедших в эти дни клиентов.
# Он написал следующий код.

#Ваша задача — переписать код так, чтобы он работал с помощью функции enumerate(). Таким образом, вам необходимо создать
# цикл по индексам и элементам списка user_dynamics.


user_dynamics = [-5, 2, 4, 8, 12, -7, 5]
number_negative = None #объявляем переменную, в которой будем хранить номер последнего дня оттока, изначально она пустая (None)
#N = len(user_dynamics) #вычисляем длину списка
#создаём цикл по элементам последовательности от 0 до N (не включая N)
#for i in range(N): # i — индекс текущего элемента
for day, pop in enumerate(user_dynamics):
    #проверяем условие оттока — текущий элемент отрицательный
    if pop < 0: #если условие истинно,
        #number_negative = i+1  #перезаписываем значение номера дня
        print("Churn value: ", pop) # выводим количество ушедших в этот день пользователей
        print("Number day: ", day+1) # выводим номер дня
        print('---next day---')