#Допишите программу, которая проверяет гипотезу Сиракуз. Гипотеза Сиракуз заключается в том,
# что любое натуральное число можно свести к 1, если повторять над ним следующие действия:

#если число чётное, разделить его пополам, т. е. n = n // 2;
#если нечётное — умножить на 3, прибавить 1 и результат разделить на 2, т. е. n = (n * 3 + 1) // 2.

n = 19 #задаём число
#создаём бесконечный цикл
while True:
    if n == 1: #если результат равен 1,
        print('Syracuse hypothesis holds') #выводим утвердительное сообщение
        break
    elif n % 2 == 0:
        print(n)
        print(f'--{n}/2--------------')
        n = n // 2
    elif n % 2 != 0:
        print(n)
        print(f'--({n}*3+1)/2--------')
        n = (n*3+1)/2
