#Дан словарь my_dict. Его значения могут быть как строками (тип str), так и числами (типы int и float).
#Посчитайте, сколько значений в словаре my_dict являются числами. Используйте в своём коде оператор continue.
my_dict = {'a': 15, 'b': 10.5, 'c': '15', 'd': 50, 'e': 15, 'f': '15'}
int_1 = 0

for key in my_dict:
    if type(my_dict[key]) is str:
        continue
    else:
        int_1 += 1
print(f'Количество числе в словаре равно: {int_1}')
